#==========================================================================
# Topic : R Quiz
# Date : 2019. 03. 21
# Author : Junmo Nam
#==========================================================================


#==========================================================================
# Q. 데이터프레임 형식으로 된 어떤 column 의 element 들을 24개씩 묶어서 더한 값으로 이루어진 새로운 column 을 만들고 싶습니다  
#==========================================================================

require(dplyr)
data.frame(a = 1:48) %>% mutate(group = c(rep(1,24),rep(2,24))) %>% group_by(group) %>% summarise(sum = sum(a))


#==========================================================================
# Q. 모든 칼럼의 row 평균치를 날짜별로 불러오고 싶어요 
#==========================================================================

iris %>% mutate(date =c(rep('2016-10-01',100),rep('2016-10-02',50))) %>% 
  mutate(date = as.Date(date)) %>% select(-Species) %>% group_by(date) %>% summarise_all(mean)

#==========================================================================
# Q. 데이터프레임을 변수 y의 종류에 따라 필터링하고 칼럼의 평균을 구하고 싶습니다
#==========================================================================

df = data.frame(x1 = runif(100),x2 = runif(100),y = c(rep('class1',50),rep('class2',50))) #example dataframe

lapply(levels(df$y),function(x){filter(df,y==!!x) %>% select(x)}) %>% #y 팩터 변수의 종류별로 필터링 후 변수 x를 고른 결과를 리스트에 저장 
  sapply(colMeans)


#==========================================================================
# Q. 그래프 fill이 제가 원하는 white, black으로 되지 않네요. 어떤 부분이 잘못된 것인지 궁금하네요.
#==========================================================================

require(ggplot2)
data.frame(id = as.factor(1:2),freq = c(10,50)) %>% ggplot(aes(x=id,y=freq,fill=id)) +geom_col() #id를 팩터로 넣고 자동지정된 색 사용 
data.frame(id = as.factor(1:2),freq = c(10,50)) %>% ggplot(aes(x=id,y=freq))+ 
  geom_col(fill = c('white','black')) #원하는 색상 지정 


#==========================================================================
# Q. 생성한 모델을 저장하여 다른 로컬로 옮겨 사용할 수 있는 방법이 궁금합니다.
#==========================================================================

a = 1:10
rm(list = ls()[-grep('a',ls())]) #a 오브젝트만 남기고 삭제 -> 저장

#==========================================================================
# Q. R에서 대문자파이(모든값곱)는 명령어가 어떻게될까요
#==========================================================================

prod(1:4) #1*2*3*4

#==========================================================================
# Q. geom_histogram, geom_density를 동시에 그리려고 합니다 -> density의 값이 너무 낮아서 안그려짐
#==========================================================================

iris %>% ggplot(aes(Sepal.Length))+
  geom_histogram(aes(y=..density..),col = 'white')+
  geom_density(size = 2,col = 'red')+
  ggtitle('Histogram with density plot','geom_hist + geom_density')

#==========================================================================
# Q. 연도별 고객 중복이용현황을 알고 싶습니다. -> 데이터 펼치기(그림참조)
#==========================================================================

require(tidyr)
data.frame(year = c(rep(2014,5),2015,rep(2016,2)),
           customer = c(rep(1,4),rep(2,3),3),
           company = c(rep('a',5),rep('b',2),'c')) %>%
  group_by(year,company) %>%
  summarise(customer_visit = n()) %>%
  spread(company,customer_visit)





